# ElementIntersectsFilter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIntersectsFilter Methods
ElementIntersectsFilter Class See Also
---
The ElementIntersectsFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from ElementFilter.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCategorySupported | Identifies if the input element is of a category supported by element intersection filters. |
| IsElementSupported | Identifies if the input element is supported by element intersection filters. |
| PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
| PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace